{"source": "/kaggle/working/manhwa-script/input/1.jpg", "caption": "Male K-pop idol in Korean Manhwa style, head-to-waist crop, fair skin, natural black tousled hair, light beard, and rectangular glasses. Wearing black leather jacket over white tee, holding a mic mid-performance. Background has red neon Korean sign with the word SEOUL, soft spotlight glow and concert stage lighting for a bold popstar vibe.", "target": "/kaggle/working/manhwa-script/output/1_1.png"}
{"source": "/kaggle/working/manhwa-script/input/1.jpg", "caption": "Male K-pop singer in Korean Manhwa style, head-to-waist crop, fair skin, soft spiky black hair, subtle facial hair, and sharp brows. Wearing a black leather jacket over a white t-shirt, holding a mic with a relaxed expression. Background features a red neon Korean sign with concert stage lights and glowing haze, giving a dramatic popstar stage presence and vibrant energy.", "target": "/kaggle/working/manhwa-script/output/1_2.png"}
{"source": "/kaggle/working/manhwa-script/input/1.jpg", "caption": "Male K-pop idol in Korean Manhwa style, head-to-waist crop, fair skin, sharp jawline, thick black hair styled with volume, and subtle facial hair. Wearing a black leather jacket over a white t-shirt, holding dark sunglasses in one hand with a confident smirk. Background features red neon Korean signage with glowing spotlight haze, evoking a cool stage-ready atmosphere and polished popstar presence.", "target": "/kaggle/working/manhwa-script/output/1_3.png"}
{"source": "/kaggle/working/manhwa-script/input/2.jpg", "caption": "K-pop Manhwa male character illustrated in Korean Manhwa style, head-to-waist crop with fair skin, full beard, receding hairline, and confident smile. Dressed in an all-black outfit featuring a bomber jacket, polo shirt, and wristwatch, with hands clasped at the center. Background includes bold red neon Korean text with spotlight beams and a soft glow, creating a strong stage-like ambiance with K-pop visual energy.", "target": "/kaggle/working/manhwa-script/output/2_1.png"}
{"source": "/kaggle/working/manhwa-script/input/2.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, cropped from head to waist, featuring fair skin, a full beard, neatly styled voluminous brown hair, and a cheerful smile. Wearing transparent round glasses, layered silver chains, a white crew-neck tee, and a dark jacket for a stylish stage-ready look. Background displays red neon Korean signage with the word SEOUL and vivid spotlight flares, adding a dynamic concert vibe.", "target": "/kaggle/working/manhwa-script/output/2_2.png"}
{"source": "/kaggle/working/manhwa-script/input/2.jpg", "caption": "K-pop Manhwa male character illustrated in Korean Manhwa style, cropped from head to waist with fair skin, full beard, styled voluminous brown hair, and a subtle smile. Wearing round glasses, silver earrings, layered chain necklaces, and a black jacket with a cartoon flame logo over a white t-shirt. Background features neon-lit street with purple signage reading COOL ZONE, creating a trendy nightlife vibe in a modern K-pop setting.", "target": "/kaggle/working/manhwa-script/output/2_3.png"}
{"source": "/kaggle/working/manhwa-script/input/3.jpg", "caption": "K-pop Manhwa male character illustrated in Korean Manhwa style, head-to-waist crop with a warm brown skin tone, neatly trimmed beard, and voluminous textured hair. Wearing clear-framed glasses, layered silver chains, and a bold red button-down shirt with sleeves rolled up. Background features red neon Korean text and concert-style spotlights, enhancing the vibrant popstar energy with a fiery stage mood.", "target": "/kaggle/working/manhwa-script/output/3_1.png"}
{"source": "/kaggle/working/manhwa-script/input/3.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with fair skin, sharp jawline, voluminous styled hair, and neatly shaped beard. Wearing transparent-framed glasses, layered silver chains, and a red button-up shirt with rolled sleeves. Background showcases red neon lights with the word SEOUL and concert spotlights, capturing a bold stage presence and K-pop concert ambiance.", "target": "/kaggle/working/manhwa-script/output/3_2.png"}
{"source": "/kaggle/working/manhwa-script/input/3.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, cropped from head to waist with fair skin, thick voluminous hair, trimmed beard, and round glasses. Wearing layered silver chains, a white tee under a black jacket, and a matching chain bracelet while holding a microphone. Background features glowing red Korean neon text with starburst lights, capturing a charismatic pop idol presence on stage.", "target": "/kaggle/working/manhwa-script/output/3_3.png"}
{"source": "/kaggle/working/manhwa-script/input/4.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with fair skin, tousled black hair with soft waves, and a light beard. Wearing clear-framed glasses, silver chains, a white tee, and a dark checkered blazer for a polished idol look. Background features glowing red neon Korean text with subtle light flares, capturing a classy stage presence with modern K-pop flair.", "target": "/kaggle/working/manhwa-script/output/4_1.png"}
{"source": "/kaggle/working/manhwa-script/input/4.jpg", "caption": "K-pop Manhwa male character illustrated in Korean Manhwa style, head-to-waist crop with warm brown skin, tousled black hair, thick beard, and a stern expression. Wearing black-rimmed glasses, a checkered blazer over a white t-shirt, thick silver chain, and headset mic, holding a microphone in one hand. Background features red neon Korean characters and soft spotlights, emphasizing a bold pop idol persona with intense stage presence.", "target": "/kaggle/working/manhwa-script/output/4_2.png"}
{"source": "/kaggle/working/manhwa-script/input/4.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with fair skin, soft wavy hair, neatly groomed beard, and a wide cheerful smile. Wearing clear-framed glasses, layered silver chains, a white t-shirt, and a brown checkered blazer. Holding a microphone confidently, with a red neon Korean sign and concert spotlights in the background, creating an upbeat and energetic popstar stage vibe.", "target": "/kaggle/working/manhwa-script/output/4_3.png"}
{"source": "/kaggle/working/manhwa-script/input/5.jpg", "caption": "K-pop Manhwa male character illustrated in Korean Manhwa style, head-to-waist crop with fair skin, bald head, thick gray beard, and a wide joyful smile. Wearing round glasses, silver chains, a black blazer over a white tee, and holding a microphone with a ring on his finger. Background features neon Korean and English signs reading SEOUL and CITY, set against a colorful night cityscape with glowing lights, evoking a bold and stylish K-pop concert vibe.", "target": "/kaggle/working/manhwa-script/output/5_1.png"}
{"source": "/kaggle/working/manhwa-script/input/5.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with fair skin, bald head, thick gray beard, and a bright smile. Wearing transparent glasses, silver earrings, layered chain necklaces, and rings on both hands, dressed in a black patterned shirt and fitted blazer. Holding a microphone confidently. Background features glowing red Korean neon signs and stage lights, highlighting a bold, charismatic idol presence in a live concert setting.", "target": "/kaggle/working/manhwa-script/output/5_2.png"}
{"source": "/kaggle/working/manhwa-script/input/5.jpg", "caption": "K-pop Manhwa male character illustrated in Korean Manhwa style, head-to-waist crop with fair skin, bald head, long gray beard, and a bright charismatic smile. Wearing round glasses, silver earrings, stacked rings, layered bracelets, and multiple chains over a patterned black shirt and blazer. Holding a mic with one hand and gesturing with the other. Background features bold red neon text reading K-POP with diagonal stage lights and sparkles, highlighting a glamorous and stylish idol look.", "target": "/kaggle/working/manhwa-script/output/5_3.png"}
{"source": "/kaggle/working/manhwa-script/input/6.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with fair skin, curly black hair, light beard, and a cheerful smile. Wearing thick black-framed glasses, a chunky silver chain, a black graphic tee, and a black blazer. Holding two microphones in a performance-ready pose. Background features bold red neon Korean text reading SEOUL and diagonal concert lights, adding high-energy K-pop stage vibes.", "target": "/kaggle/working/manhwa-script/output/6_1.png"}
{"source": "/kaggle/working/manhwa-script/input/6.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with fair skin, curly hair, graying beard, and a wide cheerful smile. Wearing thick glasses, layered silver chains, a black printed tee, and a black denim jacket. Holding a microphone confidently, with rings on fingers and a bracelet for added style. Background features bold red neon Korean signage with diagonal spotlight beams and sparkles, creating a vibrant and energetic idol concert vibe.", "target": "/kaggle/working/manhwa-script/output/6_2.png"}
{"source": "/kaggle/working/manhwa-script/input/6.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with fair skin, curly black hair, full beard, and a bright smile. Wearing black rectangular glasses, multiple layered silver chains, rings on both hands, and a black V-neck tee with a fitted black blazer. Holding a microphone with confidence. Background features glowing red neon Korean and English signs with soft city lights, capturing the vibrant energy of a live K-pop street performance.", "target": "/kaggle/working/manhwa-script/output/6_3.png"}
{"source": "/kaggle/working/manhwa-script/input/7.jpg", "caption": "K-pop Manhwa male character illustrated in Korean Manhwa style, head-to-waist crop with warm fair skin, sharp jawline, neatly styled voluminous black hair, and a wide cheerful smile. Wearing silver hoop earrings, layered silver chains, and a beige t-shirt featuring a sunset wave graphic with the text WAVESTATION. Background includes red neon lights and subtle concert beams, giving off a trendy, casual K-pop idol vibe with a beachy twist.", "target": "/kaggle/working/manhwa-script/output/7_1.png"}
{"source": "/kaggle/working/manhwa-script/input/7.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with warm skin tone, voluminous textured black hair, and a radiant smile. Wearing double silver chains, a black t-shirt with bold white text reading LOYALTY, and holding a microphone with a silver ring on his finger. Background features glowing red neon signs and soft spotlight beams, capturing an energetic street concert ambiance with confident K-pop idol charisma.K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with warm-toned skin, close-cropped hair, thick eyebrows, and a strong goatee with a serious expression. Dressed in an all-black outfit featuring a black crew-neck t-shirt and a black jacket, giving a sleek and minimal aesthetic. Background features bold red neon Korean text and geometric stage lights, creating a dramatic and intense pop idol atmosphere.", "target": "/kaggle/working/manhwa-script/output/7_2.png"}
{"source": "/kaggle/working/manhwa-script/input/8.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with fair skin, styled black hair, thin mustache and goatee, and a soft confident smile. Wearing a hoop earring, layered silver chains, a black crew-neck shirt, and a black denim-style jacket. Holding a microphone with a silver ring and bracelet. Background features vibrant red neon Korean signs and soft spotlights, creating a calm yet charismatic stage-ready K-pop vibe.", "target": "/kaggle/working/manhwa-script/output/8_1.png"}
{"source": "/kaggle/working/manhwa-script/input/8.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with warm-toned skin, close-cropped hair, thick eyebrows, and a strong goatee with a serious expression. Dressed in an all-black outfit featuring a black crew-neck t-shirt and a black jacket, giving a sleek and minimal aesthetic. Background features bold red neon Korean text and geometric stage lights, creating a dramatic and intense pop idol atmosphere.", "target": "/kaggle/working/manhwa-script/output/8_2.png"}
{"source": "/kaggle/working/manhwa-script/input/8.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with warm skin tone, sharp black hair, full beard, and a composed serious expression. Wearing layered silver chains, a black crew-neck shirt, and a sleek black blazer. A mic wire loops from his ear, suggesting stage readiness. Background features bold red neon Korean characters and angled light beams, reflecting a powerful and charismatic K-pop idol vibe.", "target": "/kaggle/working/manhwa-script/output/8_3.png"}
{"source": "/kaggle/working/manhwa-script/input/8.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with fair skin, short-cropped black hair, thick eyebrows, and a neatly trimmed goatee with a serious, intense look. Dressed entirely in black, featuring a plain crew-neck t-shirt under a structured jacket. Background includes red neon Korean signage and abstract spotlight beams, evoking a minimalist yet bold K-pop stage presence with silent charisma.", "target": "/kaggle/working/manhwa-script/output/8_4.png"}
{"source": "/kaggle/working/manhwa-script/input/9.jpg", "caption": "K-pop Manhwa male character illustrated in Korean Manhwa style, head-to-waist crop with warm fair skin, soft youthful features, and a subtle smile. Sporting tousled black hair, defined brows, and a silver chain around the neck. Dressed in a casual brown button-down shirt with a relaxed collar. Background features glowing red neon Korean signs including “서울” and vibrant stage lights, radiating a laid-back yet charming K-pop idol vibe.", "target": "/kaggle/working/manhwa-script/output/9_1.png"}
{"source": "/kaggle/working/manhwa-script/input/9.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with warm skin tone, side-swept black hair, defined eyebrows, and a bright, confident smile. Wearing layered silver chains, a brown button-down shirt with rolled cuffs, silver rings and bracelets, and a hoop earring. Holding a microphone mid-performance. Background features red neon Korean text and the word LIVE with glowing diagonal stage lights, capturing an exciting live concert moment in classic K-pop flair.", "target": "/kaggle/working/manhwa-script/output/9_2.png"}
{"source": "/kaggle/working/manhwa-script/input/9.jpg", "caption": "K-pop Manhwa male character in Korean Manhwa style, head-to-waist crop with radiant skin tone, perfectly styled black hair, and a wide, charming smile. Dressed in a layered black outfit featuring a deep v-neck inner tee and a relaxed button-down shirt. Accessorized with stacked silver chains, rings, and a bracelet. Background features glowing red neon lights with abstract Korean characters and diagonal beams, exuding vibrant concert energy and youthful popstar appeal.", "target": "/kaggle/working/manhwa-script/output/9_3.png"}
{"source": "/kaggle/working/manhwa-script/input/10.jpg", "caption": "K-pop Manhwa male idol in Korean webtoon style, cropped from head to waist with sharp facial features, intense expression, and a short spiked hairstyle. Styled in an all-black layered outfit—deep V-neck tee, sleek jacket—and accessorized with dual silver rope chains. Wearing an earpiece mic, portraying a commanding stage presence. Background glows with bold red neon hangul text and dramatic lighting beams, exuding fierce energy and popstar dominance.", "target": "/kaggle/working/manhwa-script/output/10_1.png"}
{"source": "/kaggle/working/manhwa-script/input/10.jpg", "caption": "K-pop Manhwa male idol in Korean webtoon style, head-to-waist crop with rugged expression, sharp jawline, and short spiked hair. Dressed in a black zip-up jacket over a plain tee, holding a mic in one hand. Wearing a thin gold chain and matching bracelet, giving a subtle luxury vibe. Background lit with intense red neon hangul text and angled spotlight beams, evoking a strong stage presence and commanding K-pop energy.", "target": "/kaggle/working/manhwa-script/output/10_2.png"}
{"source": "/kaggle/working/manhwa-script/input/10.jpg", "caption": "K-pop Manhwa male idol in intense Korean webtoon style, close-up crop from chest up with a fierce expression and sharp brows. Styled with short, spiked hair and a trimmed beard. Wearing a sleek black blazer over a dark tee, with a headset mic for a commanding stage presence. The red neon signage and glowing spotlights in the background add a dramatic flair, highlighting his powerful and unshakeable idol energy.", "target": "/kaggle/working/manhwa-script/output/10_3.png"}
{"source": "/kaggle/working/manhwa-script/input/11.jpg", "caption": "K-pop Manhwa male idol with a relaxed street-style vibe, illustrated in warm Korean webtoon tones. Dressed casually in a white tee with a black sling backpack, his charming smile and slightly wavy long hair give off an easygoing charisma. The red neon-lit Korean alleyway in the background adds a nostalgic nighttime Seoul aesthetic, blending urban energy with idol coolness.", "target": "/kaggle/working/manhwa-script/output/11_1.png"}
{"source": "/kaggle/working/manhwa-script/input/11.jpg", "caption": "K-pop Manhwa male idol radiating cool confidence with soft waves and a stylish beard. Outfitted in a classic black leather jacket layered over a white tee and chains, he rocks the mic-ready look of a main vocalist. The red neon Seoul signage in the backdrop amps up the retro K-pop concert vibe, spotlighting his easy smile and rocker charm.", "target": "/kaggle/working/manhwa-script/output/11_2.png"}
{"source": "/kaggle/working/manhwa-script/input/11.jpg", "caption":  "K-pop Manhwa male idol radiating cool confidence with soft waves and a stylish beard. Outfitted in a classic black leather jacket layered over a red-accented shirt and thick silver chain, he grips the mic like a seasoned performer. The bold red neon LIVE and Korean signage in the background amplifies the electrifying concert vibe, spotlighting his infectious smile and charismatic stage energy.", "target": "/kaggle/working/manhwa-script/output/11_3.png"}
{"source": "/kaggle/working/manhwa-script/input/12.jpg", "caption": "K-pop Manhwa male idol with a charismatic smile and voluminous black hair styled to perfection. Dressed in an all-black outfit layered with sleek silver chains and a casual open-collar jacket, he radiates effortless star power. The glowing red Seoul signage behind him and subtle concert lights set the scene for a laid-back yet iconic K-pop stage moment.", "target": "/kaggle/working/manhwa-script/output/12_1.png"}
{"source": "/kaggle/working/manhwa-script/input/12.jpg", "caption": "K-pop Manhwa male idol flaunting a charismatic grin with his jet-black hair perfectly tousled. Rocking a modern leather jacket over a crisp white tee, layered chains add a bold edge to his stage-ready look. Set against a vibrant red neon backdrop with Korean script, the scene pulses with the high-energy vibe of a K-pop concert night.", "target": "/kaggle/working/manhwa-script/output/12_2.png"}
{"source": "/kaggle/working/manhwa-script/input/12.jpg", "caption": "K-pop Manhwa male idol exuding laid-back charm with his tousled fringe and warm eyes. Dressed in a vibrant red bomber jacket over a black tee, accessorized with a sleek chain and mic in hand, he’s ready to own the stage. The glowing red concert lights behind him create a bold and electric vibe, amplifying his cool, approachable energy.", "target": "/kaggle/working/manhwa-script/output/12_3.png"}
{"source": "/kaggle/working/manhwa-script/input/13.jpg", "caption": "K-pop Manhwa male idol with a calm charisma, styled in a crisp black denim shirt over a white tee. His neatly swept hair and soft gaze channel a quiet strength, while the silver chain adds a touch of idol flair. Set against a vivid red spotlight and neon Seoul signage, his poised stance gives off the magnetic vibe of a group leader before showtime.", "target": "/kaggle/working/manhwa-script/output/13_1.png"}
{"source": "/kaggle/working/manhwa-script/input/13.jpg", "caption": "K-pop Manhwa male idol exuding quiet allure with swept-back brown hair and warm, expressive eyes. Wearing a fitted indigo denim jacket over a soft white crew neck and a minimal chain, his look is effortlessly cool. Set against the red neon glow of Korean text, he channels the understated charm of a rising K-pop heartthrob preparing to captivate the stage.", "target": "/kaggle/working/manhwa-script/output/13_2.png"}
{"source": "/kaggle/working/manhwa-script/input/13.jpg", "caption": "K-pop Manhwa male idol with a sleek mic-ready setup, tousled hair and intense gaze locked in. Dressed in a layered black ensemble with a sharp leather jacket and stacked silver chains, he blends charisma and edge like a seasoned performer. The glowing red neon Korean signage and concert lights behind him set the stage for a powerful live debut.", "target": "/kaggle/working/manhwa-script/output/13_3.png"}
{"source": "/kaggle/working/manhwa-script/input/14.jpg", "caption": "K-pop Manhwa male idol channeling effortless cool with tousled waves and bold sunglasses. Rocking a fitted black tee against a neon-lit Seoul concert backdrop, his understated charisma and laid-back style radiate main dancer energy with a mysterious edge.", "target": "/kaggle/working/manhwa-script/output/14_1.png"}
{"source": "/kaggle/working/manhwa-script/input/14.jpg", "caption": "K-pop Manhwa male idol exuding fierce charisma in a sharp all-black stage suit and statement sunglasses. With tousled hair, a sleek mic headset, and a silver chain accent, he owns the spotlight like a true performance leader against the dramatic red concert lights pulsing with intensity.", "target": "/kaggle/working/manhwa-script/output/14_2.png"}
{"source": "/kaggle/working/manhwa-script/input/14.jpg", "caption": "K-pop Manhwa male idol radiating fierce leadership energy in an all-black stage suit and flowing tousled hair. With a strong gaze, stage mic, and confident pose under red spotlight beams, he embodies the intensity and discipline of a K-pop performance captain in the heat of the show.", "target": "/kaggle/working/manhwa-script/output/14_3.png"}
{"source": "/kaggle/working/manhwa-script/input/15.jpg", "caption": "K-pop Manhwa male idol rocking a charming boy-next-door look with tousled hair, soft beard, and a confident smile. Dressed in a red plaid shirt with rolled-up sleeves and black trousers, he gives off laid-back heartthrob vibes. The glowing red “Seoul” neon backdrop highlights his warm stage presence, making him the perfect fan-favorite on a cozy acoustic set.", "target": "/kaggle/working/manhwa-script/output/15_1.png"}
{"source": "/kaggle/working/manhwa-script/input/15.jpg", "caption": "K-pop Manhwa male idol exuding smooth charisma with side-swept tousled hair, a neatly groomed stubble, and a subtle smirk. Clad in a sleek black leather jacket over an all-black ensemble, his silver chain and single hoop earring complete the edgy look. The glowing red signage in the background and soft spotlighting create a bold, confident concert aura fit for a lead dancer with mysterious appeal.", "target": "/kaggle/working/manhwa-script/output/15_2.png"}
{"source": "/kaggle/working/manhwa-script/input/15.jpg", "caption": "K-pop Manhwa male idol with charming boy-next-door appeal, soft textured hair, and a friendly smile that lights up the stage. Styled in a black zip-up jacket over a crisp white tee with layered silver chains, he rocks a subtle mic and warm presence perfect for fan interactions. The vibrant red Korean signage and concert beams behind him add a punch of energy to his effortlessly approachable look.", "target": "/kaggle/working/manhwa-script/output/15_3.png"}
{"source": "/kaggle/working/manhwa-script/input/16.jpg", "caption": "K-pop Manhwa male idol exuding focused charm with softly styled black hair and a trimmed beard. Wearing a sleek black bomber jacket over a matching tee and silver chain, his look is both polished and casual. The studio headset hints at a behind-the-scenes rehearsal vibe, while the glowing red signage in the background adds a dramatic stage-ready energy.", "target": "/kaggle/working/manhwa-script/output/16_1.png"}
{"source": "/kaggle/working/manhwa-script/input/16.jpg", "caption": "K-pop Manhwa male idol bringing a bold, headliner vibe with neatly styled hair and a sharp beard. Dressed in a black denim jacket with striking red accents over a dark tee and layered chains, he’s got that sleek concert charisma. The red neon '라이브' glow and spotlights in the background complete the high-energy stage presence.", "target": "/kaggle/working/manhwa-script/output/16_2.png"}
{"source": "/kaggle/working/manhwa-script/input/16.jpg", "caption": "K-pop Manhwa male idol exuding smoldering stage presence with a confident stare and perfectly styled jet-black hair. Sporting a fitted black leather jacket over a white tee and thick silver chains, he channels the edgy lead vocalist vibe. The glowing red Korean signage and dramatic spotlight beams seal the moody concert-night aesthetic.", "target": "/kaggle/working/manhwa-script/output/16_3.png"}
{"source": "/kaggle/working/manhwa-script/input/17.jpg", "caption": "K-pop Manhwa male idol with a calm, collected stage vibe, flaunting a sleek zip-up jacket over a graphic tee with bold Hangul lettering. His layered chains, neatly trimmed facial hair, and glasses add a mature idol edge, while the glowing red lights and Korean concert signs in the background enhance the veteran popstar aura.", "target": "/kaggle/working/manhwa-script/output/17_1.png"}
{"source": "/kaggle/working/manhwa-script/input/17.jpg", "caption": "K-pop Manhwa male idol with an iconic rockstar presence, sporting tousled long hair, statement glasses, and a red bomber jacket over a Hangul concert tee. His calm yet powerful gaze channels the wisdom of a seasoned performer, perfectly matched by the crimson stage lights and bold Korean backdrop that set the tone for a commanding stage vibe.", "target": "/kaggle/working/manhwa-script/output/17_2.png"}
{"source": "/kaggle/working/manhwa-script/input/18.jpg", "caption": "K-pop Manhwa male idol serving edgy charisma in oversized frames, dual chains, and a sleek black leather jacket over a vibrant Korean lettered tee. His sharp undercut and poised stare exude stage-ready authority, while the glowing crimson backdrop adds a powerful contrast to his modern concert look.", "target": "/kaggle/working/manhwa-script/output/18_1.png"}
{"source": "/kaggle/working/manhwa-script/input/18.jpg", "caption": "K-pop Manhwa male idol exuding composed elegance with a polished undercut, jet-black blazer, and layered statement chains. His thick-rimmed glasses and subtle earring highlight his refined, intellectual charm, set against a fiery concert backdrop pulsing with red spotlight intensity.", "target": "/kaggle/working/manhwa-script/output/18_2.png"}
{"source": "/kaggle/working/manhwa-script/input/18.jpg", "caption": "K-pop Manhwa male idol channeling tech-savvy charisma in a sleek blazer layered over a bold Korean-type tee. His dual silver chains and trendy glasses enhance his stylish edge, while the headset mic and dynamic red lighting scream main event energy on stage.", "target": "/kaggle/working/manhwa-script/output/18_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/1.jpg", "caption": "K-pop manhwa female idol stealing the spotlight in glittery black stagewear. Her long, sleek hair frames a radiant smile, with stylish round glasses adding a pop of charm. The layered silver chains and heart pendant complete her edgy glam look, while red concert lights and bold Korean neon signage in the background enhance her rising-star aura.", "target": "/kaggle/working/manhwa-script/output-female/1_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/1.jpg", "caption": "K-pop manhwa female idol radiating effortless charm in a glittery silver jacket and cropped black ensemble. Her long, wavy hair frames a confident smile, enhanced by sleek glasses and hoop earrings. With layered silver chains and a headset mic, she’s ready to take center stage under the warm glow of concert spotlights and bold red neon signage, capturing the essence of a rising pop queen.", "target": "/kaggle/working/manhwa-script/output-female/1_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/1.jpg", "caption": "K-pop manhwa female idol lighting up the stage with an infectious laugh and radiant stage energy. Dressed in a sparkly cropped jacket over a sleek black top and pants, her confident glow is matched by bold silver chains and dangling earrings. The red neon backdrop pulses with concert energy, perfectly framing her carefree charm and joyful charisma.", "target": "/kaggle/working/manhwa-script/output-female/1_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/2.jpg", "caption": "K-pop manhwa female idol stealing the spotlight in glittery black stagewear. Her long, sleek hair frames a radiant smile, with stylish round glasses adding a pop of charm. The layered silver chains and heart pendant complete her edgy glam look, while red concert lights and bold Korean neon signage in the background enhance her rising-star aura.", "target": "/kaggle/working/manhwa-script/output-female/2_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/2.jpg", "caption": "K-pop manhwa female idol radiating effortless charm in a glittery silver jacket and cropped black ensemble. Her long, wavy hair frames a confident smile, enhanced by sleek glasses and hoop earrings. With layered silver chains and a headset mic, she’s ready to take center stage under the warm glow of concert spotlights and bold red neon signage, capturing the essence of a rising pop queen.", "target": "/kaggle/working/manhwa-script/output-female/2_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/2.jpg", "caption": "K-pop manhwa female idol lighting up the stage with an infectious laugh and radiant stage energy. Dressed in a sparkly cropped jacket over a sleek black top and pants, her confident glow is matched by bold silver chains and dangling earrings. The red neon backdrop pulses with concert energy, perfectly framing her carefree charm and joyful charisma.", "target": "/kaggle/working/manhwa-script/output-female/2_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/3.jpg", "caption": "K-pop manhwa female idol stealing the spotlight in glittery black stagewear. Her long, sleek hair frames a radiant smile, with stylish round glasses adding a pop of charm. The layered silver chains and heart pendant complete her edgy glam look, while red concert lights and bold Korean neon signage in the background enhance her rising-star aura.", "target": "/kaggle/working/manhwa-script/output-female/3_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/3.jpg", "caption": "K-pop manhwa female idol radiating effortless charm in a glittery silver jacket and cropped black ensemble. Her long, wavy hair frames a confident smile, enhanced by sleek glasses and hoop earrings. With layered silver chains and a headset mic, she’s ready to take center stage under the warm glow of concert spotlights and bold red neon signage, capturing the essence of a rising pop queen.", "target": "/kaggle/working/manhwa-script/output-female/3_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/3.jpg", "caption": "K-pop manhwa female idol radiating soft elegance with a calm, poised smile and flawless stage presence. Her glitter-dusted black cropped jacket and matching outfit reflect the subtle glam of a seasoned performer. Silver heart and rope necklaces add a sweet yet bold charm, while the red concert lights behind her frame her with quiet star power.", "target": "/kaggle/working/manhwa-script/output-female/3_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/4.jpg", "caption": "K-pop manhwa female idol with playful charm and cheeky attitude, sticking out her tongue in a fun stage moment. Her twin ponytails and sparkly black crop jacket add youthful flair, while chunky silver chains and a heart pendant complete her edgy K-pop ensemble. Set against vivid red concert lights, she lights up the stage with bold personality.", "target": "/kaggle/working/manhwa-script/output-female/4_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/4.jpg", "caption": "K-pop manhwa female idol with a cheeky tongue-out expression, bringing playful energy to the stage. Her wavy dark hair flows freely, paired with a sparkling red cropped jacket and sleek black top. Silver chains and hoop earrings add bold flair, all set against vibrant red concert lights spelling "콘서트" in neon glow.", "target": "/kaggle/working/manhwa-script/output-female/4_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/4.jpg", "caption": "K-pop manhwa female idol showing off a playful attitude with a tongue-out expression. Her shimmering silver top and bold blue leather jacket give her a cool, confident edge. Loose waves frame her face, while layered silver chains and hoop earrings complete the look. Neon red lights pulse behind her with bold Korean lettering, amplifying her stage presence.", "target": "/kaggle/working/manhwa-script/output-female/4_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/5.jpg", "caption": "K-pop manhwa female idol glowing under concert lights with a sweet, confident smile. She wears a sparkly black cropped jacket over a ribbed top, layered with silver heart and chain necklaces. Her long, sleek hair flows naturally, paired with hoop earrings and a stage mic. Behind her, the red neon signs and soft spotlight create a classic K-pop concert vibe.", "target": "/kaggle/working/manhwa-script/output-female/5_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/5.jpg", "caption": "K-pop manhwa female idol radiating charm under neon purple lights with a wide, joyful smile. Dressed in a glittery lavender cropped jacket over a black top, she pairs silver layered chains and a heart-shaped pendant for a perfect stage-ready vibe. Her long flowing hair, hoop earrings, and sleek mic complete the dazzling popstar look. The vibrant concert background enhances her bubbly and confident aura.", "target": "/kaggle/working/manhwa-script/output-female/5_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/5.jpg", "caption": "K-pop manhwa female idol exuding warmth in a spotlight-lit concert setting. Dressed in a sleek all-black ensemble with a long-sleeve crop top and high-waisted pants, she accessorizes with silver hoop earrings, chunky layered necklaces, and a heart pendant. Her soft smile and side-parted hair create an effortlessly charming look, radiating grace and poise under the red concert lights.", "target": "/kaggle/working/manhwa-script/output-female/5_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/6.jpg", "caption": "K-pop manhwa female idol radiating bold charisma under crimson concert lights. With her hair styled in a high bun, she rocks a studded leather vest over a red sequined crop top, paired with black high-waisted pants. Statement accessories include silver hoop earrings, layered chains, and a heart pendant. Her confident smile and visible floral arm tattoo make her a standout powerhouse on stage.", "target": "/kaggle/working/manhwa-script/output-female/6_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/6.jpg", "caption": "K-pop manhwa female idol exuding confidence and flair on a red-lit live stage. Her sparkly black crop top and matching studded vest add bold glam, while layered heart-shaped silver necklaces and hoop earrings elevate the look. With a high bun, nose ring, and a stunning floral tattoo on her arm, she radiates powerful popstar energy and charm.", "target": "/kaggle/working/manhwa-script/output-female/6_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/6.jpg", "caption": "K-pop manhwa female idol with an energetic smile and radiant stage vibe. She rocks a teal sleeveless denim jacket over a black crop top, styled with silver hoops and her signature floral tattoo on her arm. Her hair is tied up in a high bun with loose waves flowing, glowing under red concert lights that amplify her playful, confident charisma.", "target": "/kaggle/working/manhwa-script/output-female/6_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/7.jpg", "caption": "K-pop manhwa female idol with graceful poise and magnetic charm. Styled in a sleek black off-shoulder top with shimmering textures, she radiates elegance on stage. Her soft waves fall effortlessly, paired with hoop earrings and dual layered silver chains. The red concert lights and bold Korean neon signage behind her amplify her serene, confident presence.", "target": "/kaggle/working/manhwa-script/output-female/7_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/7.jpg", "caption": "K-pop manhwa female idol with celestial charm and stage presence. Dressed in a bold off-shoulder red crop top and black skirt, she dazzles under concert spotlights. Her elegant star-shaped earrings and chunky gold star necklace add a signature flair, while her soft smile and bindi complete her iconic blend of cultural grace and K-pop confidence. Neon Korean signage glows in the background, capturing her radiant vibe.", "target": "/kaggle/working/manhwa-script/output-female/7_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/7.jpg", "caption": "K-pop manhwa female idol with fierce energy and modern glam. Dressed in an all-black studded cropped jacket and matching crop top, she owns the stage with a confident smile and bold septum ring. Her sleek hair, hoop earrings, and layered silver chains complete the edgy aesthetic, while the electric blue and violet spotlight concert background enhances her star appeal.", "target": "/kaggle/working/manhwa-script/output-female/7_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/8.jpg", "caption": "K-pop manhwa female idol serving attitude and glam. Rocking oversized black shades, a sparkly black outfit, and silver heart and chain accessories, she exudes cool confidence. Her playful expression and star-shaped earrings highlight her popstar charisma against the fiery red concert backdrop. Total main character energy.", "target": "/kaggle/working/manhwa-script/output-female/8_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/8.jpg", "caption": "K-pop manhwa female idol glowing in the night. Styled in a sleek black leather jacket, skull-print top, and Chanel necklace, she radiates edgy glam. Her bright smile, dangling star earrings, and pushed-up shades add playful popstar charm. Set against a neon-lit Korean street, she’s pure midnight muse vibes. ", "target": "/kaggle/working/manhwa-script/output-female/8_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/8.jpg", "caption": "K-pop manhwa female idol with effortless charm. Dressed in a glittery black corset top and faded denim jacket, her layered silver necklaces and heart pendant exude stage-ready glam. With her signature shades perched on her head, hoop earrings, and radiant smile, she commands the spotlight against a glowing red concert backdrop. ", "target": "/kaggle/working/manhwa-script/output-female/8_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/9.jpg", "caption": "K-pop manhwa female idol with timeless poise. Styled in a shimmering silver jacket over a sleek black crop top, her look is accented by bold layered necklaces and a braided side ponytail. With a confident smile and mic in place, she owns the red-lit concert stage with an elegant and edgy presence.", "target": "/kaggle/working/manhwa-script/output-female/9_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/9.jpg", "caption": "K-pop manhwa female idol caught in a joyful candid. Dressed in a pastel pink bomber jacket and a playful smiley tee, she beams at the camera mid-selfie on a neon-lit Korean street. Her casual charm, sparkling rings, and carefree pose radiate pure Gen Z idol energy.", "target": "/kaggle/working/manhwa-script/output-female/9_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/9.jpg", "caption": "K-pop manhwa female idol commanding the concert stage. Clad in a black shimmer crop jacket and heart pendant, she belts out high notes with eyes closed in bliss. The fiery red spotlight, bold earrings, and fearless confidence radiate her superstar charisma.", "target": "/kaggle/working/manhwa-script/output-female/9_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/10.jpg", "caption": "K-pop manhwa female idol in concert-ready elegance. Dressed in a glitter-speckled black jacket and heart pendant necklace, she exudes serene confidence. Her gentle smile and sleek hairstyle are lit by red neon signs, capturing the quiet power of a rising star.", "target": "/kaggle/working/manhwa-script/output-female/10_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/10.jpg", "caption": "K-pop manhwa female idol glowing with fierce grace. Dressed in a shimmering black crop top and leather jacket, layered with bold silver chains, she radiates stage-ready charisma. Her soft smile and expressive eyes shine under the vibrant red concert lights, blending power and elegance in perfect harmony.", "target": "/kaggle/working/manhwa-script/output-female/10_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/10.jpg", "caption": "K-pop manhwa female idol beaming with stage charisma. Rocking a bold red and black fringed crop top with a matching cropped jacket and wide belt, she owns the spotlight with her confident smile and powerful stance. Her high ponytail, edgy choker, and chunky silver chain complete the fierce concert-ready look against a glowing red neon backdrop.", "target": "/kaggle/working/manhwa-script/output-female/10_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/11.jpg", "caption": "K-pop manhwa female idol radiating cool elegance. Dressed in a sleek black crop top and a studded leather jacket, she pairs her look with a heart-shaped pendant, layered chains, and hoop earrings. Her long flowing hair and subtle smile exude poise and charm, while the red neon 'idol' backdrop sets the perfect stage-lit vibe.", "target": "/kaggle/working/manhwa-script/output-female/11_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/11.jpg", "caption": "K-pop manhwa female idol mid-performance, glowing with joy. Dressed in a glittery black jacket and layered silver necklaces, she belts out a powerful note with eyes closed and a radiant smile. Her flowing dark hair and confident stage presence pop against the red neon concert lights in the background.", "target": "/kaggle/working/manhwa-script/output-female/11_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/11.jpg", "caption": "K-pop manhwa female idol shining on stage. Wearing a sparkly silver corset top under a studded black leather jacket, she beams confidently while red neon Korean lights glow behind her. Her long flowing hair, statement star earrings, and layered heart necklace complete the ultimate popstar look.", "target": "/kaggle/working/manhwa-script/output-female/11_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/12.jpg", "caption": "K-pop manhwa female idol ready for the spotlight. Wearing a glittery cropped jacket over a sleek black top, her confident gaze and soft smile steal the show. Heart-shaped pendant, silver hoops, and a bindi highlight her unique charm against a glowing red concert backdrop.", "target": "/kaggle/working/manhwa-script/output-female/12_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/12.jpg", "caption": "K-pop manhwa female idol shining on stage. Dressed in a dazzling black sequin crop top and matching jacket, her infectious smile and star-shaped earrings radiate confidence. With flowing hair, a heart pendant, and a glowing red concert backdrop, she captures the true spirit of a K-pop superstar.", "target": "/kaggle/working/manhwa-script/output-female/12_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/12.jpg", "caption": "K-pop manhwa female idol lighting up the stage. With a radiant smile, heart-shaped pendant, and a glittering black jacket over a matching crop top, she commands attention under the red concert lights. Her confident aura and sleek hair make her the ultimate pop sensation.", "target": "/kaggle/working/manhwa-script/output-female/12_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/13.jpg", "caption": "K-pop manhwa female idol radiating starlight. With long flowing hair, bold hoop earrings, and a sequined black jacket over a sleek crop top, she shines against the glowing red concert lights. Her wide, sparkling smile and poised charm make her the heart of every performance.", "target": "/kaggle/working/manhwa-script/output-female/13_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/13.jpg", "caption": "K-pop manhwa female idol sparkling with elegance. Dressed in a shimmering black crop top and a sleek leather jacket, her radiant smile and confident stage aura light up the crimson spotlight. With layered silver chains, hoop earrings, and a poised mic, she’s every bit the show-stopping performer.", "target": "/kaggle/working/manhwa-script/output-female/13_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/13.jpg", "caption": "K-pop manhwa female idol radiating star power. Styled in a silver polka-dotted top and a bold black leather jacket, she beams confidently under the concert lights. Her layered chain necklaces, sleek long hair, and dazzling smile make her the ultimate stage queen.", "target": "/kaggle/working/manhwa-script/output-female/13_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/13.jpg", "caption": "K-pop manhwa female idol radiating starlight. With long flowing hair, bold hoop earrings, and a sequined black jacket over a sleek crop top, she shines against the glowing red concert lights. Her wide, sparkling smile and poised charm make her the heart of every performance.", "target": "/kaggle/working/manhwa-script/output-female/13_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/13.jpg", "caption": "K-pop manhwa female idol sparkling with elegance. Dressed in a shimmering black crop top and a sleek leather jacket, her radiant smile and confident stage aura light up the crimson spotlight. With layered silver chains, hoop earrings, and a poised mic, she’s every bit the show-stopping performer.", "target": "/kaggle/working/manhwa-script/output-female/13_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/13.jpg", "caption": "K-pop manhwa female idol radiating star power. Styled in a silver polka-dotted top and a bold black leather jacket, she beams confidently under the concert lights. Her layered chain necklaces, sleek long hair, and dazzling smile make her the ultimate stage queen.", "target": "/kaggle/working/manhwa-script/output-female/13_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/14.jpg", "caption": "K-pop manhwa female idol with fierce stage presence. Dressed in a shimmering white leather jacket and matching crop top, she exudes edgy elegance. Her sharp fringe, bold red lips, and layered chains highlight her confident, charismatic aura under the red concert lights.", "target": "/kaggle/working/manhwa-script/output-female/14_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/14.jpg", "caption": "K-pop manhwa female idol mid-performance. Dressed in a glittery black crop top and matching jacket, she beams with infectious joy while holding the mic. Her silver hoop earrings and double-chain necklace with a heart pendant add a touch of charm. Red spotlight concert stage vibes complete the idol magic.", "target": "/kaggle/working/manhwa-script/output-female/14_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/14.jpg", "caption": "K-pop manhwa female idol serving fierce charm. With a playful tongue-out expression, she rocks a bold red leather jacket over a glittery black crop top. Her layered silver chains, hoop earrings, and flawless stage makeup add to the idol attitude. Red spotlight background seals the concert drama.", "target": "/kaggle/working/manhwa-script/output-female/14_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/15.jpg", "caption": "K-pop manhwa female idol in selfie mode! Rocking a casual pink patterned crop top and a ponytail, she flashes a playful peace sign while holding up her phone. With soft blush, big doe eyes, and a headset mic, she brings cheerful behind-the-scenes energy against a red-lit concert backdrop.", "target": "/kaggle/working/manhwa-script/output-female/15_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/15.jpg", "caption": "K-pop manhwa female idol caught mid-selfie! Dressed in a trendy denim jacket over a black crop top, she beams with infectious joy, capturing the moment with her phone. Her wide eyes and open smile radiate excitement, set against a glowing red concert backdrop, mic ready for her next stage!", "target": "/kaggle/working/manhwa-script/output-female/15_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/15.jpg", "caption": "K-pop manhwa female idol lighting up the stage! Rocking a sparkly lilac bomber jacket over a black crop top, she beams with confidence and youthful energy. Her soft blush and cheerful smile, paired with the glowing red concert backdrop, capture her charm mid-performance.", "target": "/kaggle/working/manhwa-script/output-female/15_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/16.jpg", "caption": "K-pop manhwa female idol with soft waves and stage presence! Her voluminous auburn hair and dazzling layered chains exude elegance under the neon-red glow. Dressed in a sleek black cropped outfit, her gentle smile and confident stance command the spotlight with poise and power.", "target": "/kaggle/working/manhwa-script/output-female/16_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/16.jpg", "caption": "K-pop manhwa female idol stealing the spotlight! With sleek ombré waves flowing over a bold red leather jacket, she radiates fierce elegance. Her sparkling black crop top and double-chain necklace amplify her rockstar aura, while her warm smile and poised mic stance complete the ultimate concert queen look.", "target": "/kaggle/working/manhwa-script/output-female/16_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/16.jpg", "caption": "K-pop manhwa female idol glowing with charm! With soft waves cascading over a glitter-specked black jacket and a golden shimmer crop top, she embodies glam and grace. The layered chains, warm eyes, and confident mic pose seal her look as the ultimate fan-favorite on stage.", "target": "/kaggle/working/manhwa-script/output-female/16_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/17.jpg", "caption": "K-pop manhwa female idol radiating elegance! Dressed in a sleek black sequin jacket and matching crop top, she lights up the stage with her warm smile and confident gaze. The side-swept waves, minimal earrings, and signature stage mic complete her fierce yet graceful performance look.", "target": "/kaggle/working/manhwa-script/output-female/17_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/17.jpg", "caption": "K-pop manhwa female idol beaming with star power! Styled in a shimmering silver blazer over a black crop top, her confident smile and expressive eyes captivate the spotlight. The sleek heart pendant, in-ear mic, and her perfectly styled hair complete this glamorous performance-ready look.", "target": "/kaggle/working/manhwa-script/output-female/17_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/17.jpg", "caption": "K-pop manhwa female idol glowing with edgy elegance! Rocking a deep olive cropped jacket over a sparkly black top, she pairs bold cross earrings and layered silver chains with her radiant smile and sleek hairstyle. The soft red spotlight and her poised confidence scream main-stage energy.", "target": "/kaggle/working/manhwa-script/output-female/17_3.png"}
{"source": "/kaggle/working/manhwa-script/input-female/18.jpg", "caption": "K-pop manhwa female idol radiating confident charm! Styled in a sleek black cropped jacket layered over a teal textured top, she brings subtle glam with chunky silver chains and hoop earrings. Her side ponytail and soft smile light up the red neon stage, making her a standout in any live performance.", "target": "/kaggle/working/manhwa-script/output-female/18_1.png"}
{"source": "/kaggle/working/manhwa-script/input-female/18.jpg", "caption": "K-pop manhwa female idol blowing hearts! With a glittery silver cropped blazer over a sleek black stage top, she pairs charisma with elegance. Her heart-shaped necklace and voluminous dark waves frame her face as she puckers up playfully on stage under the glow of red neon lights.", "target": "/kaggle/working/manhwa-script/output-female/18_2.png"}
{"source": "/kaggle/working/manhwa-script/input-female/18.jpg", "caption": "K-pop manhwa female idol serving pout perfection! Rocking a glittery black stage outfit with a cropped jacket, heart pendant, and high-waisted pants, she strikes a kissy face mid-performance. Her sleek side ponytail and shimmering red-lit stage background bring pure popstar energy to life.", "target": "/kaggle/working/manhwa-script/output-female/18_3.png"}