{"input": "./input_female/1.jpg", "caption": "K-pop manhwa style, A digital illustration of an She stands resolute, her expression fierce and determined under pulled-back dark hair. Her black suit features striking orange glowing lines, emphasizing her form and readiness.", "output": "./output_female/1.png"}
{"input": "./input_female/2.jpg", "caption": "K-pop manhwa style, A digital illustration of an A determined woman stands clad in a dark tactical suit accented with glowing orange lines. Blue and purple energy crackles with power from her outstretched left hand.", "output": "./output_female/2.png"}
{"input": "./input_female/3.jpg", "caption": "K-pop manhwa style, A digital illustration of an A smiling woman with long dark hair wears a black tactical suit accented with glowing orange and blue lines. Blue energy arcs from her outstretched left hand, while her right hand rests confidently on her hip.", "output": "./output_female/3.png"}
{"input": "./input_female/4.jpg", "caption": "K-pop manhwa style, A digital illustration of an With a neutral, slightly curious expression, this character has large, dark, wide-set eyes, thick dark eyebrows, and full, naturally colored lips. Her long dark hair frames her rounder face, and a small dark bindi is centered on her forehead.", "output": "./output_female/4.png"}
{"input": "./input_female/5.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a pleasant, gentle smile, warm dark eyes, and well-defined arched eyebrows. Her dark hair is neatly pulled back, and a small red bindi adorns her forehead, complementing her oval face shape.", "output": "./output_female/5.png"}
{"input": "./input_female/6.jpg", "caption": "K-pop manhwa style, A digital illustration of an Smiling confidently, this character's eyes are hidden behind round sunglasses. Visible features include arched eyebrows, full lips curved upwards, and wavy brown hair framing her face.", "output": "./output_female/6.png"}
{"input": "./input_female/7.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a neutral expression with large, wide-set brown eyes, neatly defined arched eyebrows, and full, naturally colored lips. Her long, straight dark brown hair frames her oval face.", "output": "./output_female/7.png"}
{"input": "./input_female/8.jpg", "caption": "K-pop manhwa style, A digital illustration of an Presenting a determined and serious look, this character has focused dark eyes under slightly furrowed brows, defined eyebrows, and firmly set lips. Her dark hair is pulled back neatly in a bun, highlighting her strong jawline.", "output": "./output_female/8.png"}
{"input": "./input_female/9.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character exhibits a serious, mature expression with eyes slightly narrowed behind glasses, thin defined eyebrows, and neutral lips. Her short, dark curly hair frames her face, and a small bindi is visible on her forehead.", "output": "./output_female/9.png"}
{"input": "./input_female/10.jpg", "caption": "K-pop manhwa style, A digital illustration of an Beaming with a wide smile showing white teeth, this character has bright, dark almond-shaped eyes and defined arched eyebrows. Her dark hair is pulled back into a ponytail, and a small red bindi is on her forehead.", "output": "./output_female/10.png"}
{"input": "./input_female/11.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character shows a broad, confident smile revealing white teeth, along with bright dark eyes and well-defined arched eyebrows. Her long, dark hair flows freely, framing her oval face, and a small red bindi is present.", "output": "./output_female/11.png"}
{"input": "./input_female/12.jpg", "caption": "K-pop manhwa style, A digital illustration of an With a neutral, composed expression, this character has dark, almond-shaped eyes, defined arched eyebrows, and full lips. Her dark hair is styled in a neat bun, and gold hoop earrings are visible.", "output": "./output_female/12.png"}
{"input": "./input_female/13.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a serious expression with large, dark almond-shaped eyes, defined arched eyebrows, and full lips painted a deep red. Her long black hair frames her face, and a small red bindi is centered on her forehead.", "output": "./output_female/13.png"}
{"input": "./input_female/14.jpg", "caption": "K-pop manhwa style, A digital illustration of an Smiling widely and warmly, this character reveals white teeth, has bright dark eyes crinkled slightly at the corners, and defined arched eyebrows. Her dark hair is pulled back, emphasizing her cheekbones.", "output": "./output_female/14.png"}
{"input": "./input_female/15.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a very wide, cheerful smile showing white teeth, with large, bright dark eyes and defined, arched eyebrows. Her long, curly brown hair frames her round face shape.", "output": "./output_female/15.png"}
{"input": "./input_female/16.jpg", "caption": "K-pop manhwa style, A digital illustration of an Featuring a pleasant smile, this character has bright dark eyes, defined arched eyebrows, and smiling lips. Her dark, wavy hair is pulled back, and a small red bindi is visible on her forehead.", "output": "./output_female/16.png"}
{"input": "./input_female/17.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a neutral, slightly focused expression with dark almond-shaped eyes and defined, arched eyebrows. Her long dark hair frames her face, featuring a prominent white streak at the front.", "output": "./output_female/17.png"}
{"input": "./input_female/18.jpg", "caption": "K-pop manhwa style, A digital illustration of an With an intense, serious expression, this character has sharp, focused dark eyes, defined dark eyebrows, and firmly set lips. Her head is completely shaved, emphasizing her defined facial structure.", "output": "./output_female/18.png"}
{"input": "./input_female/19.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character displays a serious, determined expression with focused dark eyes, defined arched eyebrows, and neutral lips. Her long dark hair flows freely around her shoulders.", "output": "./output_female/19.png"}
{"input": "./input_female/20.jpg", "caption": "K-pop manhwa style, A digital illustration of an With a stern, intense expression, this character has narrowed dark eyes under furrowed brows and firmly set lips. Her dark hair is pulled back, revealing small stud earrings.", "output": "./output_female/20.png"}
{"input": "./input_female/21.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a stern, focused expression with slightly narrowed eyes, defined eyebrows, and neutral lips. Her dark hair is pulled back neatly, showcasing her defined jawline.", "output": "./output_female/21.png"}
{"input": "./input_female/22.jpg", "caption": "K-pop manhwa style, A digital illustration of an Displaying a focused, intense expression, this character has dark eyes looking forward, defined arched eyebrows, and neutral lips. Her long dark hair flows loosely around her shoulders.", "output": "./output_female/22.png"}
{"input": "./input_female/23.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a determined expression with dark, focused eyes, arched dark eyebrows, and neutral lips. Her wavy brown hair frames her face.", "output": "./output_female/23.png"}
{"input": "./input_female/24.jpg", "caption": "K-pop manhwa style, A digital illustration of an Smiling warmly, this character shows white teeth, has kind dark eyes, and defined, slightly arched eyebrows. Her dark, wavy shoulder-length hair frames her face.", "output": "./output_female/24.png"}
{"input": "./input_female/25.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a serious, focused expression with sharp dark eyes, angled eyebrows, and neutral lips. Her long, straight black hair frames her face.", "output": "./output_female/25.png"}
{"input": "./input_female/26.jpg", "caption": "K-pop manhwa style, A digital illustration of an With a gentle, neutral expression, this character has large, round dark eyes, defined dark eyebrows, and naturally colored lips. Her long black hair frames her face.", "output": "./output_female/26.png"}
{"input": "./input_female/27.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a pleasant, soft smile, warm dark eyes, and defined arched eyebrows. Her long black hair frames her face, and a small grey bindi is visible on her forehead.", "output": "./output_female/27.png"}
{"input": "./input_female/28.jpg", "caption": "K-pop manhwa style, A digital illustration of an Featuring a wide, enthusiastic smile showing teeth, this character has bright, wide dark eyes and arched eyebrows. Her dark hair is pulled back in a high ponytail.", "output": "./output_female/28.png"}
{"input": "./input_female/29.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a gentle, pleasant smile, warm dark eyes, and defined arched eyebrows. Her dark hair is neatly pulled back into a bun, and a small red bindi is on her forehead.", "output": "./output_female/29.png"}
{"input": "./input_female/30.jpg", "caption": "K-pop manhwa style, A digital illustration of an Smiling widely, this character shows white teeth, has bright dark eyes, and defined arched eyebrows. Her long, wavy dark hair frames her face, and a small green bindi adorns her forehead.", "output": "./output_female/30.png"}
{"input": "./input_female/31.jpg", "caption": "K-pop manhwa style, A digital illustration of an This character has a serious, intense expression with sharp dark eyes, defined arched eyebrows, and neutral lips. Her dark hair is pulled back into a bun adorned with white flowers, and a red bindi is centered on her forehead.", "output": "./output_female/31.png"}
{"input": "./input_female/32.jpg", "caption": "K-pop manhwa style, A digital illustration of an Featuring a bright, wide smile showing white teeth, this character has large dark eyes and defined arched eyebrows. Her long black hair frames her face.", "output": "./output_female/32.png"}
{"input": "./input_female/33.jpg", "caption": "K-pop manhwa style, A digital illustration of an Smiling broadly, this character shows white teeth, has bright dark eyes, and defined arched eyebrows. Her long black hair frames her face, and a small red bindi is present on her forehead.", "output": "./output_female/33.png"}
{"input": "./input_female/34.jpg", "caption": "K-pop manhwa style, A digital illustration of an Smiling brightly, this character shows white teeth, has large dark eyes, and defined arched eyebrows. Her long black hair frames her oval face.", "output": "./output_female/34.png"}
{"input": "./input_female/35.jpg", "caption": "K-pop manhwa style, A digital illustration of an Smiling brightly, this character shows white teeth, has large dark eyes, and defined arched eyebrows. Her long black hair frames her oval face.", "output": "./output_female/35.png"}
{"input": "./input_female/36.jpg", "caption": "K-pop manhwa style, A digital illustration of an A bright, welcoming smile dominates her face, complemented by warm, dark eyes. Her dark hair frames a friendly expression.", "output": "./output_female/36.png"}
{"input": "./input_female/37.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her expression is poised and neutral, highlighted by striking, dark almond-shaped eyes. Long dark hair softly frames her defined features.", "output": "./output_female/37.png"}
{"input": "./input_female/38.jpg", "caption": "K-pop manhwa style, A digital illustration of an A serious, focused gaze meets the viewer, set in a face with strong angles and defined cheekbones. Her dark hair is pulled back slightly, emphasizing her determined look.", "output": "./output_female/38.png"}
{"input": "./input_female/39.jpg", "caption": "K-pop manhwa style, A digital illustration of an A wide, engaging smile lights up her features, showing perfectly white teeth. Her dark, friendly eyes and wavy dark hair complete the cheerful look.", "output": "./output_female/39.png"}
{"input": "./input_female/40.jpg", "caption": "K-pop manhwa style, A digital illustration of an Intense dark eyes hold a serious, determined expression, accented by a subtle bindi on her forehead. Her features are sharp and focused.", "output": "./output_female/40.png"}
{"input": "./input_female/41.jpg", "caption": "K-pop manhwa style, A digital illustration of an A broad, joyful smile reaches her dark eyes, conveying warmth and happiness. A small bindi rests on her forehead, complementing her rounder face shape.", "output": "./output_female/41.png"}
{"input": "./input_female/42.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her expression is neutral yet observant, with dark eyes looking directly forward. Her face has a slightly rounded shape with smooth features.", "output": "./output_female/42.png"}
{"input": "./input_female/43.jpg", "caption": "K-pop manhwa style, A digital illustration of an Weathered lines mark her face, framing dark, knowing eyes and a stern, resolute expression. A bindi sits prominently on her forehead.", "output": "./output_female/43.png"}
{"input": "./input_female/44.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her dark eyes carry a calm, serious look, and her dark hair is neatly pulled back. A red bindi accents her forehead, drawing attention to her composed expression.", "output": "./output_female/44.png"}
{"input": "./input_female/45.jpg", "caption": "K-pop manhwa style, A digital illustration of an A dazzling smile reveals perfectly aligned teeth, matched by sparkling dark eyes. A nose ring, earrings, and bindi add distinctive details to her cheerful face.", "output": "./output_female/45.png"}
{"input": "./input_female/46.jpg", "caption": "K-pop manhwa style, A digital illustration of an Striking blue eyes contrast beautifully with her dark hair, holding a confident gaze. A subtle smile plays on her lips, highlighting defined cheekbones.", "output": "./output_female/46.png"}
{"input": "./input_female/47.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her dark eyes convey a serious, focused intensity beneath neatly styled, shoulder-length dark hair. Her expression is neutral and composed.", "output": "./output_female/47.png"}
{"input": "./input_female/48.jpg", "caption": "K-pop manhwa style, A digital illustration of an Dark, intense eyes dominate her face, conveying determination and focus. A small bindi sits centered on her forehead, adding to her resolute appearance.", "output": "./output_female/48.png"}
{"input": "./input_female/49.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her dark hair is styled in a neat bun, drawing focus to her determined gaze and the glowing blue bindi on her forehead. Her expression is serious and unwavering.", "output": "./output_female/49.png"}
{"input": "./input_female/50.jpg", "caption": "K-pop manhwa style, A digital illustration of an A strong jawline and defined features frame her serious, unsmiling expression. Her dark eyes hold a steady, contemplative gaze.", "output": "./output_female/50.png"}
{"input": "./input_female/51.jpg", "caption": "K-pop manhwa style, A digital illustration of an Long, dark hair flows around a face set with a serious, almost challenging expression. Her dark eyes are sharp and focused directly ahead.", "output": "./output_female/51.png"}
{"input": "./input_female/52.jpg", "caption": "K-pop manhwa style, A digital illustration of an A slight, knowing smirk plays on her lips, echoed in her expressive dark eyes and arched brows. Her wavy dark hair frames a confident look.", "output": "./output_female/52.png"}
{"input": "./input_female/53.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her face is lit by a radiant, toothy smile that crinkles the corners of her dark, happy eyes. Wavy dark hair frames her joyful expression.", "output": "./output_female/53.png"}
{"input": "./input_female/54.jpg", "caption": "K-pop manhwa style, A digital illustration of an Dark eyes hold a steady, serious gaze within a slightly rounded face shape. Her expression is determined and unsmiling.", "output": "./output_female/54.png"}
{"input": "./input_female/55.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her dark hair is pulled back neatly, emphasizing her defined features and pouty, determined expression. Her dark eyes look forward with intent.", "output": "./output_female/55.png"}
{"input": "./input_female/56.jpg", "caption": "K-pop manhwa style, A digital illustration of an A gentle, friendly smile brightens her features, complementing her warm dark eyes. Her braided dark hair adds a soft touch to her approachable look.", "output": "./output_female/56.png"}
{"input": "./input_female/57.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her dark eyes hold a calm, neutral gaze, set within a slim face framed by dark hair. A subtle hint of a smile touches her lips.", "output": "./output_female/57.png"}
{"input": "./input_female/58.jpg", "caption": "K-pop manhwa style, A digital illustration of an Dark sunglasses conceal her eyes, drawing focus to the firm set of her mouth and defined jawline. Her expression appears cool and determined.", "output": "./output_female/58.png"}
{"input": "./input_female/59.jpg", "caption": "K-pop manhwa style, A digital illustration of an Long, dark hair frames a face with a neutral yet confident expression. Her dark eyes are clear and look directly forward with composure.", "output": "./output_female/59.png"}
{"input": "./input_female/60.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her dark hair is pulled back, highlighting her calm expression and the glowing blue bindi on her forehead. Her dark eyes hold a serene, focused look.", "output": "./output_female/60.png"}
{"input": "./input_female/61.jpg", "caption": "K-pop manhwa style, A digital illustration of an Intense dark eyes stare forward with fierce determination, set under slightly furrowed brows. Her expression is serious and resolute.", "output": "./output_female/61.png"}
{"input": "./input_female/62.jpg", "caption": "K-pop manhwa style, A digital illustration of an Dark hair styled in a neat braid frames her face, drawing attention to her calm, neutral expression. Her dark eyes look forward steadily.", "output": "./output_female/62.png"}
{"input": "./input_female/63.jpg", "caption": "K-pop manhwa style, A digital illustration of an Cool aviator sunglasses hide her eyes, while a subtle bindi rests above them. Her lips are set in a neutral, confident line, matching her determined stance.", "output": "./output_female/63.png"}
{"input": "./input_female/64.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her dark eyes hold a steady, confident gaze, complementing her neutral expression. Long dark hair frames her well-defined features.", "output": "./output_female/64.png"}
{"input": "./input_female/65.jpg", "caption": "K-pop manhwa style, A digital illustration of an A soft, serene smile graces her lips, reflected in her warm, dark eyes. Her braided dark hair enhances her gentle and approachable appearance.", "output": "./output_female/65.png"}
{"input": "./input_female/66.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her dark hair is neatly braided, accentuating the serious, determined look in her dark eyes. Her expression is focused and unwavering.", "output": "./output_female/66.png"}
{"input": "./input_female/67.jpg", "caption": "K-pop manhwa style, A digital illustration of an Dark eyes sparkle above a gentle, friendly smile, conveying warmth and kindness. Her braided hair frames her pleasant and serene expression.", "output": "./output_female/67.png"}
{"input": "./input_female/68.jpg", "caption": "K-pop manhwa style, A digital illustration of an A confident half-smile plays on her lips, matching the assured look in her dark eyes. Her dark hair is pulled back neatly in a practical ponytail.", "output": "./output_female/68.png"}
{"input": "./input_female/69.jpg", "caption": "K-pop manhwa style, A digital illustration of an Framed by glasses, her dark eyes hold a gentle, intelligent expression, paired with a soft smile. A small bindi adds a traditional touch to her look.", "output": "./output_female/69.png"}
{"input": "./input_female/70.jpg", "caption": "K-pop manhwa style, A digital illustration of an Curly dark hair surrounds a face contorted in fierce determination or anger. Her dark eyes are narrowed, and her brows are sharply furrowed.", "output": "./output_female/70.png"}
{"input": "./input_female/71.jpg", "caption": "K-pop manhwa style, A digital illustration of an An extremely wide, intense smile stretches across her face, revealing teeth and conveying an unsettling energy. Her dark eyes match the intensity of her grin.", "output": "./output_female/71.png"}
{"input": "./input_female/72.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her dark eyes hold a calm, knowing look, paired with a subtle, confident smile. A red bindi rests neatly on her forehead.", "output": "./output_female/72.png"}
{"input": "./input_female/73.jpg", "caption": "K-pop manhwa style, A digital illustration of an A large, joyful smile brightens her rounder face, reaching her sparkling dark eyes. A red bindi sits clearly on her forehead, completing the happy look.", "output": "./output_female/73.png"}
{"input": "./input_female/74.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her face is dominated by a broad, friendly smile showing white teeth. Dark, happy eyes crinkle slightly at the corners, framed by wavy dark hair.", "output": "./output_female/74.png"}
{"input": "./input_female/75.jpg", "caption": "K-pop manhwa style, A digital illustration of an A glowing, happy smile is the central feature, complemented by warm, dark eyes. Her dark hair frames her cheerful and inviting expression.", "output": "./output_female/75.png"}
{"input": "./input_female/76.jpg", "caption": "K-pop manhwa style, A digital illustration of an Her bright, toothy smile gives her face a friendly and open appearance. Dark eyes sparkle with warmth above her slightly rounded cheeks.", "output": "./output_female/76.png"}
{"input": "./input_female/77.jpg", "caption": "K-pop manhwa style, A digital illustration of an Dark, intense eyes convey seriousness and focus, accented by a small bindi on her forehead. Her expression is resolute and unyielding.", "output": "./output_female/77.png"}
{"input": "./input_female/78.jpg", "caption": "K-pop manhwa style, A digital illustration of an A wide, radiant smile dominates her features, matched by the warmth in her dark eyes. A red bindi is centered on her forehead, adding to her bright look.", "output": "./output_female/78.png"}
{"input": "./input_female/79.jpg", "caption": "K-pop manhwa style, A digital illustration of an A chic pixie cut highlights her defined cheekbones and confident, smiling expression. Her dark eyes sparkle with self-assurance.", "output": "./output_female/79.png"}
{"input": "./input_female/80.jpg", "caption": "K-pop manhwa style, A digital illustration of an Long dark hair frames her face, which holds a neutral, almost ethereal expression. Her dark eyes gaze forward calmly, hinting at inner power.", "output": "./output_female/80.png"}
{"input": "./input_male/1.jpg", "caption": "K-pop manhwa style, A digital illustration of a bald man with a short, dark beard and mustache. He has a serious expression on his face and his arms are crossed. He is wearing a dark, possibly armored-looking suit with glowing red lines on the chest and shoulders.", "output": "./output_male/1.png"}
{"input": "./input_male/2.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with dark hair, a mustache, and a short beard. He is wearing a black suit with red detailing and a black tie. There are red lightning-like effects around him.", "output": "./output_male/2.png"}
{"input": "./input_male/3.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with short dark hair, a beard, and sunglasses. He is wearing a dark, ornate hooded outfit with gold accents and a glowing emblem on his chest. He appears to be holding energy or magical effects in his hands.", "output": "./output_male/3.png"}
{"input": "./input_male/4.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with short dark hair, wearing sunglasses. He is wearing a dark, ornate hooded outfit with red accents and a glowing emblem on his chest. He appears to be holding energy or magical effects in his hand.", "output": "./output_male/4.png"}
{"input": "./input_male/5.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with dark hair and a mustache. He is wearing a blue button-down shirt, a dark belt, and a gray and white plaid blazer. There are yellow lightning-like effects emanating from his hands.", "output": "./output_male/5.png"}
{"input": "./input_male/6.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with short dark hair, a goatee, and glasses. He is wearing a dark, layered outfit with a belt. He has a red marking on his forehead and is holding a glowing blue orb with symbols and lightning effects in his hand.", "output": "./output_male/6.png"}
{"input": "./input_male/7.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with short dark hair, a beard, and a mustache. He is wearing a red and black plaid shirt, dark pants with a belt, and a dark cloak or coat. He has a glowing orange circular design with symbols and lightning effects emanating from his hand.", "output": "./output_male/7.png"}
{"input": "./input_male/8.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with short dark hair and a short beard. He is wearing a teal t-shirt with a colorful graphic on the front and a gold chain around his neck. He has a muscular build and appears to be holding energy in his hand, with lightning effects around him. There are also neon geometric shapes in the background, which I am ignoring as requested.", "output": "./output_male/8.png"}
{"input": "./input_male/9.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with short dark hair, a beard, and glasses. He is wearing a dark, armored-looking suit with a star emblem on the chest and a cape. He appears to be holding flames in both of his hands.", "output": "./output_male/9.png"}
{"input": "./input_male/10.jpg", "caption": "K-pop manhwa style, A digital illustration of a bald man with a short, dark beard. He is smiling and holding a glowing orange orb with symbols and lightning effects emanating from his hand. He is wearing a dark, ornate hooded outfit with gold accents.", "output": "./output_male/10.png"}
{"input": "./input_male/11.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with graying dark hair, a mustache, and a goatee. He has his arms crossed and is wearing a dark suit jacket over a dark vest and a light-colored shirt. He is also wearing a watch on his left wrist. There are red lightning-like effects in the background, which I am ignoring as requested.", "output": "./output_male/11.png"}
{"input": "./input_male/12.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with dark hair that is graying at the temples, and a mustache and goatee. He is wearing a dark, ornate coat with a high collar and a belt. He appears to be manipulating swirling blue water or energy with his hands.", "output": "./output_male/12.png"}
{"input": "./input_male/13.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with short dark hair, a beard, and a mustache. He is wearing a dark coat and a red shirt. He is holding a blue electric energy with his right hand.", "output": "./output_male/13.png"}
{"input": "./input_male/14.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with short dark hair, a beard, and a mustache. He is wearing headphones and a dark t-shirt.", "output": "./output_male/14.png"}
{"input": "./input_male/15.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with short dark hair, a mustache, and a short beard. He is wearing a dark hooded coat and appears to be holding a glowing red orb in his hand.", "output": "./output_male/16.png"}
{"input": "./input_male/16.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized, muscular man with short, dark reddish-brown hair, a prominent dark mustache, and rectangular glasses. He has a serious expression with furrowed brows. He's wearing a dark, structured coat with a high collar and what appears to be armored detailing on the shoulders and chest. A belt with a geometric buckle cinches his waist. His right hand is clenched into a fist, emanating a bright red, crackling energy that extends up his forearm. Similar red energy crackles around his left arm as well. In the background, there are faint, glowing red symbols or runes.", "output": "./output_male/16.png"}
{"input": "./input_male/17.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized, muscular man with short, dark reddish-brown hair, a prominent dark mustache, and rectangular glasses. He has a serious expression with furrowed brows. He's wearing a dark, structured coat with a high collar and armored detailing on the shoulders and chest. A belt with a geometric buckle cinches his waist. His right hand is clenched into a fist, emanating a bright red, crackling energy that extends up his forearm. Similar red energy crackles around his left arm as well.", "output": "./output_male/17.png"}
{"input": "./input_male/18.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized, smiling man with dark, slightly messy hair and wearing red-tinted, rectangular glasses. He has a short beard and mustache. He's wearing a dark jacket with armored shoulder pads over a red and black patterned shirt. Underneath the shirt, a glowing red and white hexagonal emblem is visible on his chest. His right hand is outstretched, surrounded by crackling purple energy that extends up his arm. Similar purple energy emanates from his left hand.", "output": "./output_male/18.png"}
{"input": "./input_male/19.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized, muscular man with short, dark hair and a serious expression. He is wearing a dark, open jacket over a dark t-shirt, and dark pants with a belt. His right hand is clenched into a fist, emanating bright yellow, crackling energy that extends up his forearm. Similar yellow energy crackles around his left arm.", "output": "./output_male/19.png"}
{"input": "./input_male/20.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized, muscular man with short, dark hair, a beard, and a serious expression. He's wearing a dark, open jacket over a dark t-shirt, and dark pants with a belt. His hands are near each other and emanating bright green, crackling energy.", "output": "./output_male/20.png"}
{"input": "./input_male/21.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark, somewhat messy hair and a determined expression. He has dark eyebrows that are slightly furrowed. He's wearing a dark, open coat with a lighter-colored trim along the edges, over a dark button-up shirt. His right hand is open and facing upwards, with bright orange and yellow flames emanating from it. His left hand is clenched into a fist at his side.", "output": "./output_male/21.png"}
{"input": "./input_male/22.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair, a mustache, and an intense expression. He has a red mark on his forehead. He is wearing a dark jacket and a light-colored scarf. His right hand is clenched and engulfed in flames.", "output": "./output_male/22.png"}
{"input": "./input_male/23.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair, a beard, and a serious expression. He is wearing a black shirt. His left hand is open, and red energy emanates from it.", "output": "./output_male/23.png"}
{"input": "./input_male/24.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with dark, slightly wavy hair, a beard, and a serious expression. He is wearing a dark jacket over a dark v-neck shirt. His right hand is clenched into a fist, and bright orange and yellow flames are emanating from it, extending up his forearm.", "output": "./output_male/24.png"}
{"input": "./input_male/25.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair, a beard, and a serious expression. He is wearing a dark coat with shoulder armor over a dark button-up shirt. His hands are cupped together, and a glowing orange energy orb is forming between them, with tendrils of energy extending outwards.", "output": "./output_male/25.png"}
{"input": "./input_male/26.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair, a beard, and a warm smile. He is holding a staff with a spiral design in his left hand, and a glowing orange energy orb in his right hand. He is wearing a dark robe.", "output": "./output_male/26.png"}
{"input": "./input_male/27.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair, a beard, and a serious expression. He is wearing a dark, high-collared jacket. His hands are clasped together in front of him, and a swirling vortex of dark energy is forming around them.", "output": "./output_male/27.png"}
{"input": "./input_male/28.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair, a beard, and a mustache. He is wearing glasses and a hooded garment. His hands are positioned near a glowing green energy.", "output": "./output_male/28.png"}
{"input": "./input_male/29.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair, a mustache, and a serious expression. He is wearing a dark robe with a lighter inner layer and a maroon sash. His hands are positioned to manipulate a swirling flow of bright blue water.", "output": "./output_male/29.png"}
{"input": "./input_male/30.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair and a stern expression. He is wearing a dark, robe-like garment with a sash. Bright blue lightning bolts are emanating from both of his outstretched hands and crackling around him.", "output": "./output_male/30.png"}
{"input": "./input_male/31.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with dark hair pulled back in a bun, a long, dark beard, and a wide smile. He is wearing a dark green and tan hooded robe. His hands are cupped, holding a glowing green energy orb with crackling energy extending outwards.", "output": "./output_male/31.png"}
{"input": "./input_male/32.jpg", "caption": "K-pop manhwa style, A digital illustration of a person in the image appears to have a face that is somewhat rounded, with a gentle jawline. His cheeks appear full, and his forehead is moderately broad. He is wearing glasses.", "output": "./output_male/32.png"}
{"input": "./input_male/33.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair and glasses, with a serious expression. He is wearing a brown, robe-like garment and a beaded necklace. His right hand is open, and a swirling vortex of light blue energy is forming above it.", "output": "./output_male/33.png"}
{"input": "./input_male/34.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair, a beard, and a stern expression. He is wearing a dark, hooded cloak. His right hand is open, holding a glowing yellow orb, and a bolt of yellow lightning extends upwards from it.", "output": "./output_male/34.png"}
{"input": "./input_male/35.jpg", "caption": "K-pop manhwa style, A digital illustration of a stylized man with short, dark hair, a beard, and glasses. He is wearing a dark, hooded robe. Blue lightning is emanating from his hand.", "output": "./output_male/35.png"}
{"input": "./input_male/36.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with a warm smile, wearing dark-rimmed glasses, and a dark outfit. He is holding a staff in one hand and making a gesture with the other.", "output": "./output_male/36.png"}
{"input": "./input_male/37.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with short, dark hair and a mustache, wearing a brown robe and a beaded necklace. He has a serious expression and appears to be gesturing with both hands, surrounded by swirling blue energy.", "output": "./output_male/37.png"}
{"input": "./input_male/38.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with dark hair, a mustache, and a beard, wearing sunglasses and a hooded green robe. He appears to be holding green flames in one hand.", "output": "./output_male/38.png"}
{"input": "./input_male/39.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with dark hair and a mustache, wearing a dark hooded robe with a symbol on the chest. He is holding a blue flame in his hand.", "output": "./output_male/39.png"}
{"input": "./input_male/40.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with dark, slightly wavy hair, a goatee, and a serious expression. He is wearing a dark coat over a dark outfit. He is holding a small, bright blue flame in his open hand. Swirls of blue energy emanate around him.", "output": "./output_male/40.png"}
{"input": "./input_male/41.jpg", "caption": "K-pop manhwa style, A digital illustration of a male figure with dark hair and a goatee is illustrated in a fantasy style, wearing a dark robe. He's surrounded by dynamic swirls of blue water-like energy against a dark background.", "output": "./output_male/41.png"}
{"input": "./input_male/42.jpg", "caption": "K-pop manhwa style, A digital illustration of a determined-looking man with dark hair and a goatee, wearing a hooded light-colored garment, holds a swirling blue energy orb between his hands.", "output": "./output_male/42.png"}
{"input": "./input_male/43.jpg", "caption": "K-pop manhwa style, A digital illustration of a bespectacled man with dark hair and a goatee, wearing a dark hooded cloak, holds a glowing orange orb crackling with energy between his hands.", "output": "./output_male/43.png"}
{"input": "./input_male/44.jpg", "caption": "K-pop manhwa style, A digital illustration of a stern-looking man with dark hair and a prominent mustache, wearing a dark brown robe, holds wispy green energy in his outstretched hands.", "output": "./output_male/44.png"}
{"input": "./input_male/45.jpg", "caption": "K-pop manhwa style, A digital illustration of a serious man with dark hair and a beard, draped in a dark cloak over a light tunic, cradles a glowing orange energy sphere in his hands, with fiery sparks emanating around him.", "output": "./output_male/45.png"}
{"input": "./input_male/46.jpg", "caption": "K-pop manhwa style, A digital illustration of a man wearing glasses and a dark red hooded robe with a large circular pendant holds a glowing orange orb with swirling patterns between his hands.", "output": "./output_male/46.png"}
{"input": "./input_male/47.jpg", "caption": "K-pop manhwa style, A digital illustration of a muscular man with dark hair and a short beard, wearing a gray long-sleeved shirt and jeans, clenches one fist as bright blue lightning crackles around his arm and hand.", "output": "./output_male/47.png"}
{"input": "./input_male/48.jpg", "caption": "K-pop manhwa style, A digital illustration of a Sikh man wearing a white turban and a red vest over a patterned shirt holds a glowing blue energy orb with crackling electricity between his open hands.", "output": "./output_male/48.png"}
{"input": "./input_male/49.jpg", "caption": "K-pop manhwa style, A digital illustration of a determined man with dark hair and a goatee, wearing a dark robe tied with a brown sash, clenches one fist while swirling blue energy emanates from his other hand and arm.", "output": "./output_male/49.png"}
{"input": "./input_male/50.jpg", "caption": "K-pop manhwa style, A digital illustration of a smiling man with dark hair and a goatee, wearing a dark hooded cloak tied at the waist, holds his hands out as bright blue lightning crackles between them and around him.", "output": "./output_male/50.png"}
{"input": "./input_male/51.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with dark curly hair, glasses, and a mustache, wearing a dark layered robe with a circular emblem, has one hand outstretched with swirling blue energy emanating from it.", "output": "./output_male/51.png"}
{"input": "./input_male/52.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with graying hair and glasses, wearing a dark hooded robe tied at the neck, holds a crackling blue energy sphere between his outstretched hands.", "output": "./output_male/52.png"}
{"input": "./input_male/53.jpg", "caption": "K-pop manhwa style, A digital illustration of a serious-looking man with dark hair and a goatee, wearing a dark hooded robe with a circular clasp, holds a glowing blue orb crackling with energy between his hands.", "output": "./output_male/53.png"}
{"input": "./input_male/54.jpg", "caption": "K-pop manhwa style, A digital illustration of a man with glasses and a goatee, wearing a dark hooded robe and a beaded necklace, gently holds a glowing green energy sphere between his hands, with green lightning crackling around him.", "output": "./output_male/54.png"}
{"input": "./input_male/55.jpg", "caption": "K-pop manhwa style, A digital illustration of a serious man with dark hair and a beard, wearing a dark hooded robe tied at the waist, levitates a glowing green orb between his hands, with tendrils of green energy swirling around it.", "output": "./output_male/55.png"}
{"input": "./input_male/56.jpg", "caption": "K-pop manhwa style, A digital illustration of a Sikh man wearing a dark blue turban and glasses, and a dark blue robe tied with a light brown sash, holds a short sword engulfed in bright blue flames in one hand.", "output": "./output_male/56.png"}
{"input": "./input_male/57.jpg", "caption": "K-pop manhwa style, A digital illustration of a smiling man with curly dark hair and glasses, wearing a hooded green jacket, holds a glowing blue orb in one outstretched hand while clutching a dark book with glowing blue symbols in the other.", "output": "./output_male/57.png"}
{"input": "./input_male/58.jpg", "caption": "K-pop manhwa style, A digital illustration of a cheerful man with dark hair and a beard, wearing a brown robe-like garment, holds a swirling golden energy orb between his outstretched hands.", "output": "./output_male/58.png"}
{"input": "./input_male/59.jpg", "caption": "K-pop manhwa style, A digital illustration of a stern-looking older man with graying hair and glasses, wearing a dark robe tied at the waist, gestures with one hand while a swirling blue energy gathers in his other palm, with streaks of blue energy crackling around him.", "output": "./output_male/59.png"}
{"input": "./input_male/60.jpg", "caption": "K-pop manhwa style, A digital illustration of a bald, intense-looking man with a goatee, wearing a dark robe tied at the waist, points towards a crackling blue energy forming in his open palm.", "output": "./output_male/60.png"}
{"input": "./input_male/61.jpg", "caption": "K-pop manhwa style, A digital illustration of a confident-looking man with dark hair and a beard, wearing a dark jacket with shoulder armor over a hooded shirt, holds a glowing blue energy orb in one hand.", "output": "./output_male/61.png"}
{"input": "./input_male/62.jpg", "caption": "K-pop manhwa style, A digital illustration of a stern man with dark hair and a thick mustache, wearing a brown martial arts-style robe, holds a glowing orange energy sphere crackling with power between his hands.", "output": "./output_male/62.png"}
{"input": "./input_male/63.jpg", "caption": "K-pop manhwa style, A digital illustration of a serious man with short dark hair, wearing a layered brown and tan hooded robe, holds his hands together in a pointed gesture.", "output": "./output_male/63.png"}
{"input": "./input_male/64.jpg", "caption": "K-pop manhwa style, A digital illustration of a handsome man with long, flowing dark hair, wearing a dark, layered outfit with a cloak, holds one hand open with swirling blue energy emanating from it.", "output": "./output_male/64.png"}
{"input": "./input_male/65.jpg", "caption": "K-pop manhwa style, A digital illustration of a serious man with dark, slightly messy hair and a full beard, wearing a dark hooded sweatshirt, levitates a swirling blue energy orb between his open hands.", "output": "./output_male/65.png"}
{"input": "./input_male/66.jpg", "caption": "K-pop manhwa style, A digital illustration of a composed man with dark hair and a short beard, wearing a dark hooded robe with a decorative neckline, gently holds a glowing yellow energy orb crackling with electricity between his hands.", "output": "./output_male/66.png"}
{"input": "./input_male/67.jpg", "caption": "K-pop manhwa style, A digital illustration of a serious young man with dark, wavy hair, wearing a dark robe tied at the waist, cradles a glowing orange energy orb in his cupped hands, with wisps of orange energy rising from it.", "output": "./output_male/67.png"}
{"input": "./input_male/68.jpg", "caption": "K-pop manhwa style, A digital illustration of a smiling man with dark hair and a beard, wearing a denim jacket over a light-colored sweater, holds a glowing blue energy ball in one hand with streaks of blue lightning emanating from it.", "output": "./output_male/68.png"}
{"input": "./input_male/69.jpg", "caption": "K-pop manhwa style, A digital illustration of a cheerful man with dark hair and a beard, wearing a dark hooded cloak, holds a large, glowing blue ice crystal in his hands while gesturing with the other.", "output": "./output_male/69.png"}
{"input": "./input_male/70.jpg", "caption": "K-pop manhwa style, A digital illustration of a smiling young man with dark curly hair and glasses, wearing a dark hooded robe over a brown shirt, levitates a glowing blue energy orb between his outstretched hands, with bright blue lightning crackling around him.", "output": "./output_male/70.png"}
{"input": "./input_male/71.jpg", "caption": "K-pop manhwa style, A digital illustration of a serious man with dark hair and a goatee, wearing a dark hooded cloak over a green shirt and a patterned scarf, levitates a swirling blue energy orb between his outstretched hands, surrounded by glowing blue circles and particles.", "output": "./output_male/71.png"}
{"input": "./input_male/72.jpg", "caption": "K-pop manhwa style, A digital illustration of a focused man with dark hair and a beard, wearing a dark robe with gold trim and a brown sash, holds a swirling flame-like orange energy in one outstretched hand.", "output": "./output_male/72.png"}
{"input": "./input_male/73.jpg", "caption": "K-pop manhwa style, A digital illustration of a serious-looking man with dark, styled hair and a neatly trimmed beard stands with his arms crossed, wearing a dark, textured jacket with subtle shoulder detailing and a belt.", "output": "./output_male/73.png"}
{"input": "./input_male/74.jpg", "caption": "K-pop manhwa style, A digital illustration of a muscular man with short dark hair and a beard, wearing a sleek black suit with glowing red circuitry patterns, stands with a serious expression and clenched fists, surrounded by crackling blue energy.", "output": "./output_male/74.png"}
{"input": "./input_male/75.jpg", "caption": "K-pop manhwa style, A digital illustration of a smiling anime-style man with dark, slightly messy hair and a goatee, wearing a sleek black and blue suit with glowing accents, has bright blue energy radiating from his chest and forming swirling runes around his wrists, with crackling lightning extending outwards.", "output": "./output_male/75.png"}
{"input": "./input_male/76.jpg", "caption": "K-pop manhwa style, A digital illustration of a bald, muscular man with a short beard, wearing a dark, futuristic suit with glowing red and blue accents, stands with clenched fists as swirling blue energy emanates from his hands.", "output": "./output_male/76.png"}
{"input": "./input_male/77.jpg", "caption": "K-pop manhwa style, A digital illustration of a smiling man with dark, messy hair and a short beard, wearing a dark, futuristic suit with glowing orange lines, holds a crackling orange energy orb in one hand.", "output": "./output_male/77.png"}